N40E116/SDK_2_6_13_FRDM-KW38/middleware/wireless/framework/OSAbstraction/Source/fsl_os_abstraction_bm.c
    /* Remove task control block from task list. */
    handler->prev->next = handler->next;
    handler->next->prev = handler->prev;
    if( handler == p_taskListHead )
    {
        p_taskListHead = handler->next;
    }

    handler->priority = taskPriority;
    /* Insert task control block into the task list. */
    if( handler->priority <= p_taskListHead->priority )
    {
        /* New task has the highest priority */
        OSA_InsertTaskBefore(handler, p_taskListHead);
        p_taskListHead = handler;
    }
    else if( handler->priority >= p_taskListHead->prev->priority )
    {
        /* New task has the lowest priority */
        OSA_InsertTaskBefore(handler, p_taskListHead);
    }
    else
    {
        p = p_taskListHead->next;

        while (TRUE)
        {
            if (handler->priority <= p->priority)
            {
                OSA_InsertTaskBefore(handler, p);
                break;
            }
            p = p->next;
        }
    }

    return osaStatus_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : task_init
 * Description   : This function is used to initialize bare metal's task system,
 * it will prepare task control block pool and initialize corresponding
 * structures. This function should be called before creating any tasks.
 *
 *END**************************************************************************/
void task_init(void)
{
    int32_t i = TASK_MAX_NUM-1;

    g_taskControlBlockPool[i].next = NULL;

    while ((i--) != 0)
    {
        /* Link all task control blocks to a list. */
        g_taskControlBlockPool[i].next = &g_taskControlBlockPool[i+1];
    }

    g_freeTaskControlBlock = g_taskControlBlockPool;
}
/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_TaskCreate
 * Description   : This function is used to create a task and make it ready.
 * Param[in]     :  threadDef  - Definition of the thread.
 *                  task_param - Parameter to pass to the new thread.
 * Return Thread handle of the new thread, or NULL if failed.
  *
 *END**************************************************************************/
osaTaskId_t OSA_TaskCreate(osaThreadDef_t *thread_def,osaTaskParam_t task_param)
{
    osaTaskId_t taskId = NULL;
    task_control_block_t *p_newTaskControlBlock;
    task_control_block_t *p_currentTaskControlBlock;

    if (g_freeTaskControlBlock != NULL)
    {
        /* Get new task control block from pool. */
        p_newTaskControlBlock         = g_freeTaskControlBlock;
        g_freeTaskControlBlock        = g_freeTaskControlBlock->next;
        /* Set task entry and parameter.*/
        p_newTaskControlBlock->p_func = thread_def->pthread;
        p_newTaskControlBlock->haveToRun = true;
        p_newTaskControlBlock->priority = (osaTaskPriority_t)PRIORITY_OSA_TO_RTOS(thread_def->tpriority);
        p_newTaskControlBlock->param  = task_param;
        p_newTaskControlBlock->next = NULL;
        p_newTaskControlBlock->prev = NULL;

        if (p_taskListHead == NULL)
        {
            p_taskListHead = p_newTaskControlBlock;
            p_taskListHead->next = p_taskListHead;
            p_taskListHead->prev = p_taskListHead;
        }
        else if (p_newTaskControlBlock->priority <= p_taskListHead->priority)
        {
            OSA_InsertTaskBefore(p_newTaskControlBlock, p_taskListHead);
            p_taskListHead = p_newTaskControlBlock;
        }
        else if (p_newTaskControlBlock->priority >= p_taskListHead->prev->priority)
        {
            OSA_InsertTaskBefore(p_newTaskControlBlock, p_taskListHead);
        }
        else
        {
            p_currentTaskControlBlock = p_taskListHead->next;

            for ( ;; )
            {
                if (p_newTaskControlBlock->priority <= p_currentTaskControlBlock->priority)
                {
                    OSA_InsertTaskBefore(p_newTaskControlBlock, p_currentTaskControlBlock);
                    break;
                }
                p_currentTaskControlBlock = p_currentTaskControlBlock->next;
            }

        }
        /* Task handler is pointer of task control block. */
        taskId = (osaTaskId_t)p_newTaskControlBlock;
    }

    return taskId;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_TaskDestroy
 * Description   : This function destroy a task.
 * Param[in]     :taskId - Thread handle.
 * Return osaStatus_Success if the task is destroied, otherwise return osaStatus_Error.
 *
 *END**************************************************************************/
osaStatus_t OSA_TaskDestroy(osaTaskId_t taskId)
{
  task_handler_t handler;
  osaStatus_t status = osaStatus_Success;
  if(taskId == NULL)
  {
    status = osaStatus_Error;
  }
  else
  {
    handler = (task_handler_t)taskId;
    if( handler == p_taskListHead )
    {
      p_taskListHead = handler->next;
    }

    /* Remove task control block from task list. */
    handler->prev->next = handler->next;
    handler->next->prev = handler->prev;

    /*
    * If current task is destroyed, then g_curTask will point to the previous
    * task, so that the subsequent tasks could be called. Check the function
    * OSA_Start for more details.
    */
    if (handler == g_curTask)
    {
      g_curTask = handler->prev;
    }

    /* Put task control block back to pool. */
    handler->prev = NULL;
    handler->next = g_freeTaskControlBlock;
    g_freeTaskControlBlock = handler;
  }
  return status;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_TimeInit
 * Description   : This function initializes the timer used in BM OSA, the
 * functions such as OSA_TimeDelay, OSA_TimeGetMsec, and the timeout are all
 * based on this timer.
 *
 *END**************************************************************************/
__WEAK_FUNC void OSA_TimeInit(void)
{
#if (FSL_OSA_BM_TIMER_CONFIG != FSL_OSA_BM_TIMER_NONE)
    SysTick->CTRL &= ~(SysTick_CTRL_ENABLE_Msk);
    SysTick->LOAD = SystemCoreClock/1000U - 1U;
    SysTick->VAL = 0;
    SysTick->CTRL |= SysTick_CTRL_ENABLE_Msk | SysTick_CTRL_TICKINT_Msk | SysTick_CTRL_CLKSOURCE_Msk;
#endif
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_TimeDiff
 * Description   : This function gets the difference between two time stamp,
 * time overflow is considered.
 *
 *END**************************************************************************/
__WEAK_FUNC uint32_t OSA_TimeDiff(uint32_t time_start, uint32_t time_end)
{
    uint32_t result;
    if (time_end >= time_start)
    {
        result = time_end - time_start;
    }
    else
    {
        result = FSL_OSA_TIME_RANGE - time_start + time_end + 1U;
    }
    return result;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA__TimeDelay
 * Description   : This function is used to suspend the active thread for the given number of milliseconds.
 *
 *END**************************************************************************/
void OSA_TimeDelay(uint32_t millisec)
{
    uint32_t currTime, timeStart;

    timeStart = OSA_TimeGetMsec();

    do {
        currTime = OSA_TimeGetMsec(); /* Get current time stamp */
    } while (millisec >= OSA_TimeDiff(timeStart, currTime));
}
/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_TimeGetMsec
 * Description   : This function gets current time in milliseconds.
 *
 *END**************************************************************************/
__WEAK_FUNC uint32_t OSA_TimeGetMsec(void)
{
#if (FSL_OSA_BM_TIMER_CONFIG != FSL_OSA_BM_TIMER_NONE)
    return gTickCounter;
#else
    return 0;
#endif
}
/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_SemaphoreCreate
 * Description   : This function is used to create a semaphore.
 * Return         : Semaphore handle of the new semaphore, or NULL if failed.
  *
 *END**************************************************************************/

osaSemaphoreId_t OSA_SemaphoreCreate(uint32_t initValue)
{
#if defined(osNumberOfSemaphores) && (osNumberOfSemaphores > 0)
  osaSemaphoreId_t semId = NULL;
  osSemaphoreStruct_t* pSemStruct;
  OSA_InterruptDisable();
  pSemStruct = (osSemaphoreStruct_t *)osObjectAlloc(&osSemaphoreInfo);
  semId = (osaSemaphoreId_t)pSemStruct;
  OSA_InterruptEnable();
  if(NULL != semId )
  {
    pSemStruct->semaphore.semCount  = (uint8_t)initValue;
    pSemStruct->semaphore.isWaiting = false;
    pSemStruct->semaphore.time_start = 0u;
    pSemStruct->semaphore.timeout = 0u;
  }
  return semId;
#else
  initValue=initValue;
  return NULL;
#endif
}
/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_SemaphoreDestroy
 * Description   : This function is used to destroy a semaphore.
 * Return        : osaStatus_Success if the semaphore is destroyed successfully, otherwise return osaStatus_Error.
 *
 *END**************************************************************************/
osaStatus_t OSA_SemaphoreDestroy(osaSemaphoreId_t semId)
{
#if defined(osNumberOfSemaphores) && (osNumberOfSemaphores > 0)
  osaStatus_t err;
  OSA_InterruptDisable();
  err = osObjectFree(&osSemaphoreInfo, semId);
  OSA_InterruptEnable();
  return err;
#else
  semId=semId;
  return osaStatus_Error;
#endif
}
/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_SemaphoreWait
 * Description   : This function checks the semaphore's counting value, if it is
 * positive, decreases it and returns osaStatus_Success, otherwise, timeout
 * will be used for wait. The parameter timeout indicates how long should wait
 * in milliseconds. Pass osaWaitForever_c to wait indefinitely, pass 0 will
 * return osaStatus_Timeout immediately if semaphore is not positive.
 * This function returns osaStatus_Success if the semaphore is received, returns
 * osaStatus_Timeout if the semaphore is not received within the specified
 * 'timeout', returns osaStatus_Error if any errors occur during waiting.
 *
 *END**************************************************************************/
osaStatus_t OSA_SemaphoreWait(osaSemaphoreId_t semId, uint32_t millisec)
{
#if defined(osNumberOfSemaphores) && (osNumberOfSemaphores > 0)
    osSemaphoreStruct_t* pSemStruct;
    osaStatus_t status = osaStatus_Idle;
    #if (FSL_OSA_BM_TIMER_CONFIG != FSL_OSA_BM_TIMER_NONE)
    uint32_t currentTime;
    #endif
    if(osObjectIsAllocated(&osSemaphoreInfo, semId) == FALSE)
    {
        status = osaStatus_Error;
    }
    else
    {
        pSemStruct = (osSemaphoreStruct_t*)semId;
        /* Check the sem count first. Deal with timeout only if not already set */

        if (pSemStruct->semaphore.semCount != 0U)
        {
            OSA_DisableIRQGlobal();
            pSemStruct->semaphore.semCount --;
            pSemStruct->semaphore.isWaiting = false;
            OSA_EnableIRQGlobal();
            status = osaStatus_Success;
        }
        else
        {
            if (0U == millisec)
            {
                /* If timeout is 0 and semaphore is not available, return kStatus_OSA_Timeout. */
                status = osaStatus_Timeout;
            }
            #if (FSL_OSA_BM_TIMER_CONFIG != FSL_OSA_BM_TIMER_NONE)
            else if (pSemStruct->semaphore.isWaiting)
            {
                /* Check for timeout */
                currentTime = OSA_TimeGetMsec();
                if (pSemStruct->semaphore.timeout < OSA_TimeDiff(pSemStruct->semaphore.time_start, currentTime))
                {
                    OSA_DisableIRQGlobal();
                    pSemStruct->semaphore.isWaiting = false;
                    OSA_EnableIRQGlobal();
                    status = osaStatus_Timeout;
                }
            }
            else if (millisec != osaWaitForever_c)    /* If don't wait forever, start the timer */
            {
                /* Start the timeout counter */
                OSA_DisableIRQGlobal();
                pSemStruct->semaphore.isWaiting = true;
                OSA_EnableIRQGlobal();
                pSemStruct->semaphore.time_start = OSA_TimeGetMsec();
                pSemStruct->semaphore.timeout = millisec;
            }
            #endif
            else
            {
                ;
            }
        }
    }
    return status;
#else
  semId=semId;
  millisec=millisec;
  return osaStatus_Error;
#endif
}
/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_SemaphorePost
 * Description   : This function is used to wake up one task that wating on the
 * semaphore. If no task is waiting, increase the semaphore. The function returns
 * osaStatus_Success if the semaphre is post successfully, otherwise returns
 * osaStatus_Error.
 *
 *END**************************************************************************/
osaStatus_t OSA_SemaphorePost(osaSemaphoreId_t semId)
{
#if defined(osNumberOfSemaphores) &&(osNumberOfSemaphores > 0)
  osSemaphoreStruct_t* pSemStruct;
  osaStatus_t status = osaStatus_Error;
  if(TRUE == osObjectIsAllocated(&osSemaphoreInfo, semId))
  {
      pSemStruct = (osSemaphoreStruct_t*)semId;
      /* The max value is 0xFF */
      if (0xFFU != pSemStruct->semaphore.semCount)
      {
          OSA_DisableIRQGlobal();
          ++pSemStruct->semaphore.semCount;
          OSA_EnableIRQGlobal();
          status = osaStatus_Success;
      }
  }
  return status;
#else /*defined(osNumberOfSemaphores) &&(osNumberOfSemaphores > 0)*/
  semId=semId;
  return osaStatus_Error;
#endif /*defined(osNumberOfSemaphores) &&(osNumberOfSemaphores > 0)*/
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_MutexCreate
 * Description   : This function is used to create a mutex.
 * Return        : Mutex handle of the new mutex, or NULL if failed.
 *
 *END**************************************************************************/
osaMutexId_t OSA_MutexCreate(void)
{
#if defined(osNumberOfMutexes) && (osNumberOfMutexes > 0)
  osaMutexId_t mutexId = NULL;
  osMutexStruct_t* pMutexStruct;
  OSA_InterruptDisable();
  pMutexStruct = (osMutexStruct_t*)osObjectAlloc(&osMutexInfo);
  mutexId = (osaMutexId_t)pMutexStruct;
  OSA_InterruptEnable();
  if( NULL != mutexId )
  {
    pMutexStruct->mutex.isLocked  = false;
    pMutexStruct->mutex.isWaiting = false;
    pMutexStruct->mutex.time_start = 0u;
    pMutexStruct->mutex.timeout = 0u;
  }
  return mutexId;
#else
  return NULL;
#endif
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_MutexLock
 * Description   : This function checks the mutex's status, if it is unlocked,
 * lock it and returns osaStatus_Success, otherwise, wait for the mutex.
 * MQX does not support timeout to wait for a mutex.
 * This function returns osaStatus_Success if the mutex is obtained, returns
 * osaStatus_Error if any errors occur during waiting. If the mutex has been
 * locked, pass 0 as timeout will return osaStatus_Timeout immediately.
 *
 *END**************************************************************************/
osaStatus_t OSA_MutexLock(osaMutexId_t mutexId, uint32_t millisec)
{
#if defined(osNumberOfMutexes) && (osNumberOfMutexes > 0)
    osMutexStruct_t* pMutexStruct;
    osaStatus_t status = osaStatus_Idle;
    #if (FSL_OSA_BM_TIMER_CONFIG != FSL_OSA_BM_TIMER_NONE)
    uint32_t currentTime;
    #endif
    if(osObjectIsAllocated(&osMutexInfo, mutexId) == FALSE)
    {
        status = osaStatus_Error;
    }
    else
    {
        pMutexStruct = (osMutexStruct_t*)mutexId;

