N40E116/SDK_2_6_13_FRDM-KW38/middleware/wireless/framework/OSAbstraction/Source/fsl_os_abstraction_bm.c
        /* Always check first. Deal with timeout only if not available. */
        if (pMutexStruct->mutex.isLocked == false)
        {
            /* Get the lock and return success */
            OSA_DisableIRQGlobal();
            pMutexStruct->mutex.isLocked = true;
            pMutexStruct->mutex.isWaiting = false;
            OSA_EnableIRQGlobal();
            status = osaStatus_Success;
        }
        else
        {
            if (0U == millisec)
            {
                /* If timeout is 0 and mutex is not available, return kStatus_OSA_Timeout. */
                status = osaStatus_Timeout;
            }
            #if (FSL_OSA_BM_TIMER_CONFIG != FSL_OSA_BM_TIMER_NONE)
            else if (pMutexStruct->mutex.isWaiting)
            {
                /* Check for timeout */
                currentTime = OSA_TimeGetMsec();
                if (pMutexStruct->mutex.timeout < OSA_TimeDiff(pMutexStruct->mutex.time_start, currentTime))
                {
                    OSA_DisableIRQGlobal();
                    pMutexStruct->mutex.isWaiting = false;
                    OSA_EnableIRQGlobal();
                    status = osaStatus_Timeout;
                }
            }
            else if (millisec != osaWaitForever_c)    /* If dont't wait forever, start timer. */
            {
              /* Start the timeout counter */
              OSA_DisableIRQGlobal();
              pMutexStruct->mutex.isWaiting = true;
              OSA_EnableIRQGlobal();
              pMutexStruct->mutex.time_start = OSA_TimeGetMsec();
              pMutexStruct->mutex.timeout = millisec;
            }
            #endif
            else
            {
                ;
            }
        }
    }
    return status;
#else
  mutexId=mutexId;
  millisec=millisec;
  return osaStatus_Error;
#endif
}
/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_MutexUnlock
 * Description   : This function is used to unlock a mutex.
 *
 *END**************************************************************************/
osaStatus_t OSA_MutexUnlock(osaMutexId_t mutexId)
{
#if defined(osNumberOfMutexes) &&(osNumberOfMutexes > 0)
  osaStatus_t status = osaStatus_Error;
  osMutexStruct_t* pMutexStruct;
  if(osObjectIsAllocated(&osMutexInfo, mutexId) == TRUE)
  {
    pMutexStruct = (osMutexStruct_t*)mutexId;
    OSA_DisableIRQGlobal();
    pMutexStruct->mutex.isLocked = false;
    OSA_EnableIRQGlobal();
    status = osaStatus_Success;
  }
  return status;
#else
  mutexId=mutexId;
  return osaStatus_Error;
#endif
}
/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_MutexDestroy
 * Description   : This function is used to destroy a mutex.
 * Return        : osaStatus_Success if the lock object is destroyed successfully, otherwise return osaStatus_Error.
 *
 *END**************************************************************************/
osaStatus_t OSA_MutexDestroy(osaMutexId_t mutexId)
{
#if defined(osNumberOfMutexes) && (osNumberOfMutexes > 0)
  osaStatus_t err;
  OSA_InterruptDisable();
  err = osObjectFree(&osMutexInfo, mutexId);
  OSA_InterruptEnable();
  return err;
#else
  mutexId=mutexId;
  return osaStatus_Error;
#endif
}
/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_EventCreate
 * Description   : This function is used to create a event object.
 * Return        : Event handle of the new event, or NULL if failed.
 *
 *END**************************************************************************/
osaEventId_t OSA_EventCreate(bool_t autoClear)
{
#if defined(osNumberOfEvents) && (osNumberOfEvents > 0)
  osaEventId_t eventId = NULL;
  osEventStruct_t* pEventStruct;
  OSA_InterruptDisable();
  pEventStruct = osObjectAlloc(&osEventInfo);
  eventId = pEventStruct;
  OSA_InterruptEnable();
  if(NULL != eventId)
  {
    pEventStruct->event.isWaiting = false;
    pEventStruct->event.flags     = 0;
    pEventStruct->event.autoClear = autoClear;
    pEventStruct->event.time_start = 0u;
    pEventStruct->event.timeout = 0u;
    pEventStruct->event.waitingTask = NULL;
  }
  return eventId;
#else
  (void)autoClear;
  return NULL;
#endif
}
/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_EventSet
 * Description   : Set one or more event flags of an event object.
 * Return        : osaStatus_Success if set successfully, osaStatus_Error if failed.
 *
 *END**************************************************************************/
osaStatus_t OSA_EventSet(osaEventId_t eventId, osaEventFlags_t flagsToSet)
{
#if defined(osNumberOfEvents) && (osNumberOfEvents > 0)
  osEventStruct_t* pEventStruct;
  osaStatus_t status = osaStatus_Error;
  if(osObjectIsAllocated(&osEventInfo, eventId) == TRUE)
  {
    pEventStruct = (osEventStruct_t*)eventId;
    /* Set flags ensuring atomic operation */
    OSA_DisableIRQGlobal();
    pEventStruct->event.flags |= flagsToSet;
    if (pEventStruct->event.waitingTask != NULL)
    {
      pEventStruct->event.waitingTask->haveToRun = true;
    }
    OSA_EnableIRQGlobal();
    status = osaStatus_Success;
  }
  return status;
#else
  (void)eventId;
  (void)flagsToSet;
  return osaStatus_Error;
#endif
}
/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_EventClear
 * Description   : Clear one or more event flags of an event object.
 * Return        :osaStatus_Success if clear successfully, osaStatus_Error if failed.
 *
 *END**************************************************************************/
osaStatus_t OSA_EventClear(osaEventId_t eventId, osaEventFlags_t flagsToClear)
{
#if defined(osNumberOfEvents) && (osNumberOfEvents > 0)
  osEventStruct_t* pEventStruct;
  osaStatus_t status = osaStatus_Error;
  if(TRUE == osObjectIsAllocated(&osEventInfo, eventId))
  {
    pEventStruct = (osEventStruct_t*)eventId;
    /* Clear flags ensuring atomic operation */
    OSA_DisableIRQGlobal();
    pEventStruct->event.flags &= ~flagsToClear;
    if (pEventStruct->event.flags != 0x00U)
    {
      if (pEventStruct->event.waitingTask != NULL)
      {
        pEventStruct->event.waitingTask->haveToRun = true;
      }
    }
    OSA_EnableIRQGlobal();
    status = osaStatus_Success;
  }
  return status;
#else /*defined(osNumberOfEvents) && (osNumberOfEvents > 0)*/
  /*no events, return directly*/
  (void)eventId;
  (void)flagsToClear;
  return osaStatus_Error;
#endif /*defined(osNumberOfEvents) && (osNumberOfEvents > 0)*/
}
/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_EventWait
 * Description   : This function checks the event's status, if it meets the wait
 * condition, return osaStatus_Success, otherwise, timeout will be used for
 * wait. The parameter timeout indicates how long should wait in milliseconds.
 * Pass osaWaitForever_c to wait indefinitely, pass 0 will return the value
 * osaStatus_Timeout immediately if wait condition is not met. The event flags
 * will be cleared if the event is auto clear mode. Flags that wakeup waiting
 * task could be obtained from the parameter setFlags.
 * This function returns osaStatus_Success if wait condition is met, returns
 * osaStatus_Timeout if wait condition is not met within the specified
 * 'timeout', returns osaStatus_Error if any errors occur during waiting.
 *
 *END**************************************************************************/
osaStatus_t OSA_EventWait(osaEventId_t eventId, osaEventFlags_t flagsToWait, bool_t waitAll, uint32_t millisec, osaEventFlags_t *pSetFlags)
{
#if defined(osNumberOfEvents) && (osNumberOfEvents > 0)
    osEventStruct_t* pEventStruct;
    #if (FSL_OSA_BM_TIMER_CONFIG != FSL_OSA_BM_TIMER_NONE)
    uint32_t currentTime;
    #endif
    osaStatus_t retVal = osaStatus_Idle;
    if(pSetFlags == NULL)
    {
        retVal = osaStatus_Error;
    }
    else
    {
        if(osObjectIsAllocated(&osEventInfo, eventId) == FALSE)
        {
            retVal = osaStatus_Error;
        }
        else
        {
            pEventStruct = (osEventStruct_t*)eventId;

            OSA_DisableIRQGlobal();
            #if (TASK_MAX_NUM > 0)
            pEventStruct->event.waitingTask = OSA_TaskGetId();
            #endif

            *pSetFlags = pEventStruct->event.flags & flagsToWait;

