N40E116/SDK_2_6_13_FRDM-KW38/middleware/wireless/framework/OSAbstraction/Source/fsl_os_abstraction_bm.c
            /* Check the event flag first, if does not meet wait condition, deal with timeout. */
            if ( (((!waitAll) && (*pSetFlags != 0U))) || (*pSetFlags == flagsToWait) )
            {
                pEventStruct->event.isWaiting = false;
                if(TRUE == pEventStruct->event.autoClear)
                {
                    pEventStruct->event.flags &= ~flagsToWait;
                                pEventStruct->event.waitingTask->haveToRun = false;
                }
                retVal = osaStatus_Success;
            }
            else
            {
                if (0U == millisec)
                {
                    /* If timeout is 0 and wait condition is not met, return kStatus_OSA_Timeout. */
                    retVal = osaStatus_Timeout;
                }
                #if (FSL_OSA_BM_TIMER_CONFIG != FSL_OSA_BM_TIMER_NONE)
                else if (pEventStruct->event.isWaiting)
                {
                    /* Check for timeout */
                    currentTime = OSA_TimeGetMsec();
                    if (pEventStruct->event.timeout < OSA_TimeDiff(pEventStruct->event.time_start, currentTime))
                    {
                        pEventStruct->event.isWaiting = false;
                        retVal = osaStatus_Timeout;
                    }
                }
                else if(millisec != osaWaitForever_c)    /* If no timeout, don't start the timer */
                {
                    /* Start the timeout counter */
                    pEventStruct->event.isWaiting = true;
                    pEventStruct->event.time_start = OSA_TimeGetMsec();
                    pEventStruct->event.timeout = millisec;
                }
                #endif
                else
                {
                    pEventStruct->event.waitingTask->haveToRun = false;
                }
            }
            OSA_EnableIRQGlobal();
        }
    }
    return retVal;
#else /*defined(osNumberOfEvents) && (osNumberOfEvents > 0)*/
    (void)eventId;
    (void)flagsToWait;
    (void)waitAll;
    (void)millisec;
    (void)pSetFlags;
    return osaStatus_Error;
#endif /*defined(osNumberOfEvents) && (osNumberOfEvents > 0)*/
}
/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_EventDestroy
 * Description   : This function is used to destroy a event object. Return
 * osaStatus_Success if the event object is destroyed successfully, otherwise
 * return osaStatus_Error.
 *
 *END**************************************************************************/
osaStatus_t OSA_EventDestroy(osaEventId_t eventId)
{
#if defined(osNumberOfEvents) && (osNumberOfEvents > 0)
  osaStatus_t err;
  OSA_InterruptDisable();
  err = osObjectFree(&osEventInfo, eventId);
  OSA_InterruptEnable();
  return err;
#else
  (void)eventId;
  return osaStatus_Error;
#endif
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_MsgQCreate
 * Description   : This function is used to create a message queue.
 * Return        : the handle to the message queue if create successfully, otherwise
 * return NULL.
 *
 *END**************************************************************************/
osaMsgQId_t OSA_MsgQCreate(uint32_t  msgNo)
{
#if defined(osNumberOfMessageQs) && (osNumberOfMessageQs > 0)
  osaMsgQId_t msgQId = NULL;
  osMsgQStruct_t* pMsgQStruct;

  if(msgNo <= (uint32_t)osNumberOfMessages)
  {
      OSA_InterruptDisable();
      pMsgQStruct = (osMsgQStruct_t *)osObjectAlloc(&osMsgQInfo);
      msgQId = (osaMsgQId_t)pMsgQStruct;
      OSA_InterruptEnable();

      if(msgQId != NULL)
      {
          pMsgQStruct->queue.max = (uint16_t)msgNo;
          pMsgQStruct->queue.number = 0;
          pMsgQStruct->queue.head = 0;
          pMsgQStruct->queue.tail = 0;
      }
  }

  return msgQId;
#else
  msgNo=msgNo;
  return NULL;
#endif
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_MsgQPut
 * Description   : This function is used to put a message to a message queue.
* Return         : osaStatus_Success if the message is put successfully, otherwise return osaStatus_Error.
 *
 *END**************************************************************************/
osaStatus_t OSA_MsgQPut(osaMsgQId_t msgQId, osaMsg_t pMessage)
{
#if defined(osNumberOfMessageQs) && (osNumberOfMessageQs > 0)
    msg_queue_t* pQueue;
    osaStatus_t status = osaStatus_Success;

    if(osObjectIsAllocated(&osMsgQInfo, msgQId) == FALSE)
    {
        status = osaStatus_Error;
    }
    else
    {
        pQueue = &((osMsgQStruct_t*)msgQId)->queue;

        OSA_DisableIRQGlobal();
        if( pQueue->number >= pQueue->max )
        {
            status = osaStatus_Error;
        }
        else
        {
            pQueue->queueMem[pQueue->tail] = *((uint32_t*)pMessage);
            pQueue->number++;
            pQueue->tail++;

            if( pQueue->tail >= pQueue->max )
            {
                pQueue->tail = 0;
            }

            if( pQueue->waitingTask != NULL)
            {
                pQueue->waitingTask->haveToRun = TRUE;
            }
        }
        OSA_EnableIRQGlobal();
    }

    return status;
#else
    msgQId=msgQId;
    pMessage=pMessage;
    return osaStatus_Error;
#endif
}
/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_MsgQGet
 * Description   : This function checks the queue's status, if it is not empty,
 * get message from it and return osaStatus_Success, otherwise, timeout will
 * be used for wait. The parameter timeout indicates how long should wait in
 * milliseconds. Pass osaWaitForever_c to wait indefinitely, pass 0 will return
 * osaStatus_Timeout immediately if queue is empty.
 * This function returns osaStatus_Success if message is got successfully,
 * returns osaStatus_Timeout if message queue is empty within the specified
 * 'timeout', returns osaStatus_Error if any errors occur during waiting.
 *
 *END**************************************************************************/
osaStatus_t OSA_MsgQGet(osaMsgQId_t msgQId, osaMsg_t pMessage, uint32_t millisec)
{
#if defined(osNumberOfMessageQs) && (osNumberOfMessageQs > 0)
    osaStatus_t status = osaStatus_Idle;
    msg_queue_t* pQueue;
#if (FSL_OSA_BM_TIMER_CONFIG != FSL_OSA_BM_TIMER_NONE)
    uint32_t currentTime;
#endif

    if(osObjectIsAllocated(&osMsgQInfo, msgQId) == FALSE)
    {
        status = osaStatus_Error;
    }
    else
    {
        pQueue = &((osMsgQStruct_t*)msgQId)->queue;
        pQueue->waitingTask = OSA_TaskGetId();

        OSA_DisableIRQGlobal();
        if( pQueue->number != 0U)
        {
            *((uint32_t*)pMessage) = pQueue->queueMem[pQueue->head];
            pQueue->number--;
            pQueue->head++;
            pQueue->isWaiting = FALSE;

            if( pQueue->head >= pQueue->max )
            {
                pQueue->head = 0;
            }
            status = osaStatus_Success;
        }
        else
        {
            if (0U == millisec)
            {
                /* If timeout is 0 and wait condition is not met, return kStatus_OSA_Timeout. */
                status = osaStatus_Timeout;
            }
#if (FSL_OSA_BM_TIMER_CONFIG != FSL_OSA_BM_TIMER_NONE)
            else if (pQueue->isWaiting)
            {
                /* Check for timeout */
                currentTime = OSA_TimeGetMsec();
                if (pQueue->timeout < OSA_TimeDiff(pQueue->time_start, currentTime))
                {
                    pQueue->isWaiting = FALSE;
                    status = osaStatus_Timeout;
                }
            }
            else if(millisec != osaWaitForever_c)    /* If no timeout, don't start the timer */
            {
                /* Start the timeout counter */
                pQueue->isWaiting = TRUE;
                pQueue->time_start = OSA_TimeGetMsec();
                pQueue->timeout = millisec;
            }
#endif
            else
            {
                pQueue->waitingTask->haveToRun = FALSE;
            }
        }
        OSA_EnableIRQGlobal();
    }

